AmrGaber1/Register-file-definition-for-Atmega32/Python def Automate/sfr_defs_23_09_20_21_06_59.h
/*Register: SPSR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 SPI2X :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 :1;
		uint8 WCOL :1;
		uint8 SPIF :1;
	}Bits;
}SPSR_reg_type;
/*SPSR Address Access Macro*/
#define SPSR_REG      (*(volatile SPSR_reg_type * const)0x0E)
/*SPSR Bit Position Macros*/
#define _SPSR_SPI2X_POSITION  0x0
#define _SPSR_WCOL_POSITION   0x6
#define _SPSR_SPIF_POSITION   0x7
/*SPSR Bit mask Macros*/
#define _SPSR_SPI2X_MASK      0x1
#define _SPSR_WCOL_MASK       0x40
#define _SPSR_SPIF_MASK       0x80


/*Register: SPCR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 SPR0 :1;
		uint8 SPR1 :1;
		uint8 CPHA :1;
		uint8 CPOL :1;
		uint8 MSTR :1;
		uint8 DORD :1;
		uint8 SPE :1;
		uint8 SPIE :1;
	}Bits;
}SPCR_reg_type;
/*SPCR Address Access Macro*/
#define SPCR_REG      (*(volatile SPCR_reg_type * const)0x0D)
/*SPCR Bit Position Macros*/
#define _SPCR_SPR0_POSITION   0x0
#define _SPCR_SPR1_POSITION   0x1
#define _SPCR_CPHA_POSITION   0x2
#define _SPCR_CPOL_POSITION   0x3
#define _SPCR_MSTR_POSITION   0x4
#define _SPCR_DORD_POSITION   0x5
#define _SPCR_SPE_POSITION    0x6
#define _SPCR_SPIE_POSITION   0x7
/*SPCR Bit mask Macros*/
#define _SPCR_SPR0_MASK       0x1
#define _SPCR_SPR1_MASK       0x2
#define _SPCR_CPHA_MASK       0x4
#define _SPCR_CPOL_MASK       0x8
#define _SPCR_MSTR_MASK       0x10
#define _SPCR_DORD_MASK       0x20
#define _SPCR_SPE_MASK        0x40
#define _SPCR_SPIE_MASK       0x80


/*Register: UCSRA*/
typedef union{
	uint8 Byte;
	struct{
		uint8 MPCM :1;
		uint8 U2X :1;
		uint8 PE :1;
		uint8 DOR :1;
		uint8 FE :1;
		uint8 UDRE :1;
		uint8 TXC :1;
		uint8 RXC :1;
	}Bits;
}UCSRA_reg_type;
/*UCSRA Address Access Macro*/
#define UCSRA_REG      (*(volatile UCSRA_reg_type * const)0x0B)
/*UCSRA Bit Position Macros*/
#define _UCSRA_MPCM_POSITION  0x0
#define _UCSRA_U2X_POSITION   0x1
#define _UCSRA_PE_POSITION    0x2
#define _UCSRA_DOR_POSITION   0x3
#define _UCSRA_FE_POSITION    0x4
#define _UCSRA_UDRE_POSITION  0x5
#define _UCSRA_TXC_POSITION   0x6
#define _UCSRA_RXC_POSITION   0x7
/*UCSRA Bit mask Macros*/
#define _UCSRA_MPCM_MASK      0x1
#define _UCSRA_U2X_MASK       0x2
#define _UCSRA_PE_MASK        0x4
#define _UCSRA_DOR_MASK       0x8
#define _UCSRA_FE_MASK        0x10
#define _UCSRA_UDRE_MASK      0x20
#define _UCSRA_TXC_MASK       0x40
#define _UCSRA_RXC_MASK       0x80


/*Register: UCSRB*/
typedef union{
	uint8 Byte;
	struct{
		uint8 TXB8 :1;
		uint8 RXB8 :1;
		uint8 UCSZ2 :1;
		uint8 TXEN :1;
		uint8 RXEN :1;
		uint8 UDRIE :1;
		uint8 TXCIE :1;
		uint8 RXCIE :1;
	}Bits;
}UCSRB_reg_type;
/*UCSRB Address Access Macro*/
#define UCSRB_REG      (*(volatile UCSRB_reg_type * const)0x0A)
/*UCSRB Bit Position Macros*/
#define _UCSRB_TXB8_POSITION  0x0
#define _UCSRB_RXB8_POSITION  0x1
#define _UCSRB_UCSZ2_POSITION 0x2
#define _UCSRB_TXEN_POSITION  0x3
#define _UCSRB_RXEN_POSITION  0x4
#define _UCSRB_UDRIE_POSITION 0x5
#define _UCSRB_TXCIE_POSITION 0x6
#define _UCSRB_RXCIE_POSITION 0x7
/*UCSRB Bit mask Macros*/
#define _UCSRB_TXB8_MASK      0x1
#define _UCSRB_RXB8_MASK      0x2
#define _UCSRB_UCSZ2_MASK     0x4
#define _UCSRB_TXEN_MASK      0x8
#define _UCSRB_RXEN_MASK      0x10
#define _UCSRB_UDRIE_MASK     0x20
#define _UCSRB_TXCIE_MASK     0x40
#define _UCSRB_RXCIE_MASK     0x80


/*Register: ACSR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 ACIS0 :1;
		uint8 ACIS1 :1;
		uint8 ACIC :1;
		uint8 ACIE :1;
		uint8 ACI :1;
		uint8 ACO :1;
		uint8 ACBG :1;
		uint8 ACD :1;
	}Bits;
}ACSR_reg_type;
/*ACSR Address Access Macro*/
#define ACSR_REG      (*(volatile ACSR_reg_type * const)0x08)
/*ACSR Bit Position Macros*/
#define _ACSR_ACIS0_POSITION  0x0
#define _ACSR_ACIS1_POSITION  0x1
#define _ACSR_ACIC_POSITION   0x2
#define _ACSR_ACIE_POSITION   0x3
#define _ACSR_ACI_POSITION    0x4
#define _ACSR_ACO_POSITION    0x5
#define _ACSR_ACBG_POSITION   0x6
#define _ACSR_ACD_POSITION    0x7
/*ACSR Bit mask Macros*/
#define _ACSR_ACIS0_MASK      0x1
#define _ACSR_ACIS1_MASK      0x2
#define _ACSR_ACIC_MASK       0x4
#define _ACSR_ACIE_MASK       0x8
#define _ACSR_ACI_MASK        0x10
#define _ACSR_ACO_MASK        0x20
#define _ACSR_ACBG_MASK       0x40
#define _ACSR_ACD_MASK        0x80


/*Register: ADMUX*/
typedef union{
	uint8 Byte;
	struct{
		uint8 MUX0 :1;
		uint8 MUX1 :1;
		uint8 MUX2 :1;
		uint8 MUX3 :1;
		uint8 MUX4 :1;
		uint8 ADLAR :1;
		uint8 REFS0 :1;
		uint8 REFS1 :1;
	}Bits;
}ADMUX_reg_type;
/*ADMUX Address Access Macro*/
#define ADMUX_REG      (*(volatile ADMUX_reg_type * const)0x07)
/*ADMUX Bit Position Macros*/
#define _ADMUX_MUX0_POSITION  0x0
#define _ADMUX_MUX1_POSITION  0x1
#define _ADMUX_MUX2_POSITION  0x2
#define _ADMUX_MUX3_POSITION  0x3
#define _ADMUX_MUX4_POSITION  0x4
#define _ADMUX_ADLAR_POSITION 0x5
#define _ADMUX_REFS0_POSITION 0x6
#define _ADMUX_REFS1_POSITION 0x7
/*ADMUX Bit mask Macros*/
#define _ADMUX_MUX0_MASK      0x1
#define _ADMUX_MUX1_MASK      0x2
#define _ADMUX_MUX2_MASK      0x4
#define _ADMUX_MUX3_MASK      0x8
#define _ADMUX_MUX4_MASK      0x10
#define _ADMUX_ADLAR_MASK     0x20
#define _ADMUX_REFS0_MASK     0x40
#define _ADMUX_REFS1_MASK     0x80


/*Register: ADCSRA*/
typedef union{
	uint8 Byte;
	struct{
		uint8 ADPS0 :1;
		uint8 ADPS1 :1;
		uint8 ADPS2 :1;
		uint8 ADIE :1;
		uint8 ADIF :1;
		uint8 ADATE :1;
		uint8 ADSC :1;
		uint8 ADEN :1;
	}Bits;
}ADCSRA_reg_type;
/*ADCSRA Address Access Macro*/
#define ADCSRA_REG      (*(volatile ADCSRA_reg_type * const)0x06)
/*ADCSRA Bit Position Macros*/
#define _ADCSRA_ADPS0_POSITION0x0
#define _ADCSRA_ADPS1_POSITION0x1
#define _ADCSRA_ADPS2_POSITION0x2
#define _ADCSRA_ADIE_POSITION 0x3
#define _ADCSRA_ADIF_POSITION 0x4
#define _ADCSRA_ADATE_POSITION0x5
#define _ADCSRA_ADSC_POSITION 0x6
#define _ADCSRA_ADEN_POSITION 0x7
/*ADCSRA Bit mask Macros*/
#define _ADCSRA_ADPS0_MASK    0x1
#define _ADCSRA_ADPS1_MASK    0x2
#define _ADCSRA_ADPS2_MASK    0x4
#define _ADCSRA_ADIE_MASK     0x8
#define _ADCSRA_ADIF_MASK     0x10
#define _ADCSRA_ADATE_MASK    0x20
#define _ADCSRA_ADSC_MASK     0x40
#define _ADCSRA_ADEN_MASK     0x80


