AmrGaber1/Register-file-definition-for-Atmega32/Python def Automate/sfr_defs_23_09_20_21_06_59.h
/*Register: TWAR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 TWGCE :1;
		uint8 TWA0 :1;
		uint8 TWA1 :1;
		uint8 TWA2 :1;
		uint8 TWA3 :1;
		uint8 TWA4 :1;
		uint8 TWA5 :1;
		uint8 TWA6 :1;
	}Bits;
}TWAR_reg_type;
/*TWAR Address Access Macro*/
#define TWAR_REG      (*(volatile TWAR_reg_type * const)0x02)
/*TWAR Bit Position Macros*/
#define _TWAR_TWGCE_POSITION  0x0
#define _TWAR_TWA0_POSITION   0x1
#define _TWAR_TWA1_POSITION   0x2
#define _TWAR_TWA2_POSITION   0x3
#define _TWAR_TWA3_POSITION   0x4
#define _TWAR_TWA4_POSITION   0x5
#define _TWAR_TWA5_POSITION   0x6
#define _TWAR_TWA6_POSITION   0x7
/*TWAR Bit mask Macros*/
#define _TWAR_TWGCE_MASK      0x1
#define _TWAR_TWA0_MASK       0x2
#define _TWAR_TWA1_MASK       0x4
#define _TWAR_TWA2_MASK       0x8
#define _TWAR_TWA3_MASK       0x10
#define _TWAR_TWA4_MASK       0x20
#define _TWAR_TWA5_MASK       0x40
#define _TWAR_TWA6_MASK       0x80


/*Register: TWSR*/
typedef union{
	uint8 Byte;
	struct{
		uint8 TWPS0 :1;
		uint8 TWPS1 :1;
		uint8 :1;
		uint8 TWS3 :1;
		uint8 TWS4 :1;
		uint8 TWS5 :1;
		uint8 TWS6 :1;
		uint8 TWS7 :1;
	}Bits;
}TWSR_reg_type;
/*TWSR Address Access Macro*/
#define TWSR_REG      (*(volatile TWSR_reg_type * const)0x01)
/*TWSR Bit Position Macros*/
#define _TWSR_TWPS0_POSITION  0x0
#define _TWSR_TWPS1_POSITION  0x1
#define _TWSR_TWS3_POSITION   0x3
#define _TWSR_TWS4_POSITION   0x4
#define _TWSR_TWS5_POSITION   0x5
#define _TWSR_TWS6_POSITION   0x6
#define _TWSR_TWS7_POSITION   0x7
/*TWSR Bit mask Macros*/
#define _TWSR_TWPS0_MASK      0x1
#define _TWSR_TWPS1_MASK      0x2
#define _TWSR_TWS3_MASK       0x8
#define _TWSR_TWS4_MASK       0x10
#define _TWSR_TWS5_MASK       0x20
#define _TWSR_TWS6_MASK       0x40
#define _TWSR_TWS7_MASK       0x80



/*Timer/Counter0 Output Compare Register*/
#define OCR0_REG      (*(volatile uint8 * const)0x3C)

/*Timer/Counter0 (8 Bits)*/
#define TCNT0_REG      (*(volatile uint8 * const)0x32)

/*Oscillator Calibration Register*/
#define OSCCAL_REG      (*(volatile uint8 * const)0x31)

/*On-Chip Debug Register*/
#define OCDR_REG      (*(volatile uint8 * const)0x31)

/*Timer/Counter1 Counter Register High Byte*/
#define TCNT1H_REG      (*(volatile uint8 * const)0x2D)

/*Timer/Counter1 Counter Register Low Byte*/
#define TCNT1L_REG      (*(volatile uint8 * const)0x2C)

/*Timer/Counter1 Output Compare Register A High Byte*/
#define OCR1AH_REG      (*(volatile uint8 * const)0x2B)

/*Timer/Counter1 Output Compare Register A Low Byte*/
#define OCR1AL_REG      (*(volatile uint8 * const)0x2A)

/*Timer/Counter1 Output Compare Register B High Byte*/
#define OCR1BH_REG      (*(volatile uint8 * const)0x29)

/*Timer/Counter1 Output Compare Register B Low Byte*/
#define OCR1BL_REG      (*(volatile uint8 * const)0x28)

/*Timer/Counter1 Input Capture Register High Byte*/
#define ICR1H_REG      (*(volatile uint8 * const)0x27)

/*Timer/Counter1 Input Capture Register Low Byte*/
#define ICR1L_REG      (*(volatile uint8 * const)0x26)

/*Timer/Counter2 (8 Bits)*/
#define TCNT2_REG      (*(volatile uint8 * const)0x24)

/*Timer/Counter2 Output Compare Register*/
#define OCR2_REG      (*(volatile uint8 * const)0x23)

/*EEPROM Address Register Low Byte*/
#define EEARL_REG      (*(volatile uint8 * const)0x1E)

/*EEPROM Data Register*/
#define EEDR_REG      (*(volatile uint8 * const)0x1D)

/*SPI Data Register*/
#define SPDR_REG      (*(volatile uint8 * const)0x0F)

/*USART I/O Data Register*/
#define UDR_REG      (*(volatile uint8 * const)0x0C)

/*USART Baud Rate Register Low Byte*/
#define UBRRL_REG      (*(volatile uint8 * const)0x09)

/*ADC Data Register High Byte*/
#define ADCH_REG      (*(volatile uint8 * const)0x05)

/*ADC Data Register Low Byte*/
#define ADCL_REG      (*(volatile uint8 * const)0x04)

/*Two-wire Serial Interface Data Register*/
#define TWDR_REG      (*(volatile uint8 * const)0x03)

/*Two-wire Serial Interface Bit Rate Register*/
#define TWBR_REG      (*(volatile uint8 * const)0x00)

#endif /* SFR_DEFS_H_ */